<a href="https://colab.research.google.com/github/zama-sarib/ML-Implementation/blob/master/pandas_basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [86]:
import numpy as np
import pandas as pd

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data=data)
df = pd.concat([df,pd.Series(labels)],axis=1)
df.rename(columns={0:'labels'},inplace=True)
df.head(20)

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5      Cranes  3.0       4       no      f
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [87]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [88]:
df.head(2)

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
1  Cranes  4.0       4      yes      b

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [89]:
pd.set_option("display.max_rows", None, "display.max_columns", None)
df[['birds','age']]

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [90]:
df.loc[[2,3,7],['birds','age','visits']]

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [91]:
df[df['visits'] < 4]

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
2     plovers  1.5       3       no      c
4  spoonbills  6.0       3       no      e
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [92]:
df[np.isnan(df['age'])][['birds','visits']]

        birds  visits
3  spoonbills       4
7      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [93]:
df[(df['birds'] == 'Cranes') & (df['age'] < 4)]

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
5  Cranes  3.0       4       no      f

**9. Select the rows the age is between 2 and 4(inclusive)**

In [94]:
df[(df['age'] >= 2) & (df['age'] <= 4)]

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
5      Cranes  3.0       4       no      f
9  spoonbills  4.0       2       no      j

**10. Find the total number of visits of the bird Cranes**

In [95]:
df[df['birds'] == 'Cranes']['visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [96]:
df.groupby('birds')['age'].mean('age')

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [97]:
data = [{'birds':'Cranes','age':4.5,'visits':3,'priority':'yes','labels':'a'}]
df = df.append(data,ignore_index=True,sort=False)
print(df.head(20))
df.drop(df.index[-1],inplace=True)
df.head(20)

         birds  age  visits priority labels
0       Cranes  3.5       2      yes      a
1       Cranes  4.0       4      yes      b
2      plovers  1.5       3       no      c
3   spoonbills  NaN       4      yes      d
4   spoonbills  6.0       3       no      e
5       Cranes  3.0       4       no      f
6      plovers  5.5       2       no      g
7       Cranes  NaN       2      yes      h
8   spoonbills  8.0       3       no      i
9   spoonbills  4.0       2       no      j
10      Cranes  4.5       3      yes      a

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5      Cranes  3.0       4       no      f
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**13. Find the number of each type of birds in dataframe (Counts)**

In [98]:
df['birds'].value_counts()

Cranes        4
spoonbills    4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [99]:
df.sort_values(by = ['age','visits'],ascending=[0,1])

        birds  age  visits priority labels
8  spoonbills  8.0       3       no      i
4  spoonbills  6.0       3       no      e
6     plovers  5.5       2       no      g
9  spoonbills  4.0       2       no      j
1      Cranes  4.0       4      yes      b
0      Cranes  3.5       2      yes      a
5      Cranes  3.0       4       no      f
2     plovers  1.5       3       no      c
7      Cranes  NaN       2      yes      h
3  spoonbills  NaN       4      yes      d

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [100]:
df['priority'] = df['priority'].apply(lambda x:'1' if x == 'yes' else '0')
df.head(10)

        birds  age  visits priority labels
0      Cranes  3.5       2        1      a
1      Cranes  4.0       4        1      b
2     plovers  1.5       3        0      c
3  spoonbills  NaN       4        1      d
4  spoonbills  6.0       3        0      e
5      Cranes  3.0       4        0      f
6     plovers  5.5       2        0      g
7      Cranes  NaN       2        1      h
8  spoonbills  8.0       3        0      i
9  spoonbills  4.0       2        0      j

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [101]:
df['birds'] = df['birds'].apply(lambda x: 'trumpeters' if x == 'Cranes' else x)
df.head(10)

        birds  age  visits priority labels
0  trumpeters  3.5       2        1      a
1  trumpeters  4.0       4        1      b
2     plovers  1.5       3        0      c
3  spoonbills  NaN       4        1      d
4  spoonbills  6.0       3        0      e
5  trumpeters  3.0       4        0      f
6     plovers  5.5       2        0      g
7  trumpeters  NaN       2        1      h
8  spoonbills  8.0       3        0      i
9  spoonbills  4.0       2        0      j